IdeaRS.OpenModel.Connection.BeamData
Provides data of the connected beam

IdeaRS.OpenModel.Connection.BeamData.Id
Id of the beam

IdeaRS.OpenModel.Connection.BeamData.Name
Name of the beam

IdeaRS.OpenModel.Connection.BeamData.Plates
Plates of the beam

IdeaRS.OpenModel.Connection.BeamData.CrossSectionType
Type of cross section

IdeaRS.OpenModel.Connection.BeamData.MPRLName
MPRL name of beam

IdeaRS.OpenModel.Connection.BeamData.OriginalModelId
Get or set the identification in the original model
In the case of the imported connection from another application